{"number_of_pages": 1, "text": "Ayush Thakur Contact\nA third-year computer science student with a strong focus on\nweb development, robotics, and industrial automation. Over\nthree years, I've developed both desktop and mobile apps,\nand I'm committed to pioneering innovative solutions in these\nfields. I'm eager to apply my skills to create state-of-the-art\nwebsites and applications that push boundaries.ayushthakur1412@gmail.com\n+91 8715808090\nPortfolio\nGithub\nLinkedin\nW ork ExperienceSkills\nLanguages & Frameworks\nTraining & W orkshops\nTen-day online Aptitude\nTraining.\nTen-day training on Python\nConcepts & Algorithms.\nTwo-day workshop on Artificial\nIntelligence and Machine\nLearningC\nPython\nHTML, CSS\nJavaScript\nReact\nSQL\nBootstrap\nMongoDB\nTools/Software\nGit\nLinux\nDocker\nPostman\nVisual Studio Code\nGetting Started with AI using\nIBM Watson.\nBuilding AI Powered Chatbots\nWithout Programming.\nResponsive Web Design.\nEducational BackgroundW eb Developer Intern, Nucleon, IIT JAMMU\nJune 2023 - July 2023\nDuring my web dev internship, I honed my skills in JavaScript, React,\nNode.js, and Git, allowing me to create impressive projects like\nportfolio and resume websites. This experience equipped me with\nexpertise in both frontend and backend web development, enhancing\nmy capabilities as a well-rounded web developer.\nIUCEE Student Chapter - Social Media Head, MIET Jammu\nNov 2022 - June 2023\nAs the Social Media Head of the IUCEE Student Chapter, I led\nresearch on Sustainable Development Goal (SDG) 15 - Life on Land. I\npresented a compelling PowerPoint presentation and authored a\nresearch paper on the topic. This role allowed me to contribute\nactively to environmental sustainability and fostered my skills in\ncommunication, research, and advocacy.\nNAT (Nature, Animals, and Technology) NGO\nOct 2023 - Ongoing\nLeading a team of 15 professionals including web developers, graphic\ndesigners, and content writers to drive impactful web projects aligned\nwith organizational goals.\nScholar| Second Year High School Student\nIndira Public Higher Secondary School\nJammu\n2019\nBachelor of Engineering in Computer Science & Engineering\nModel Institute of Engineering and Technology\nJammu\nDec 2021 - June 2025.Projects\nRent Rally : An end-to-end online car rental system utilizing React and\nNodeJS frameworks, streamlining vehicle rental operations for seamless\nuser experiences. [Link]\nCampus  Weather Insight: Engineered a bespoke weather web\napplication exclusively for Model Institute of Engineering and Technology\n(MIET), Jammu, employing React and JavaScript to deliver real-time\nweather insights tailored to campus needs. [Link]\nPersonal Portfolio: Designed and built a captivating personal portfolio\nwebsite from scratch, incorporating HTML, CSS, JS, and React\nframeworks to showcase skills and projects effectively. [Link]\nPeople.ai : A method for qualitative analysis and fitment rating of\nprospective faculty members in academic institutions. (A smart\nrecruitment system) [Link]Certification/Short Courses\nOther Projects\nVaccine Management\nSystem:  An offline tool built\nusing C language for securely\nmanaging vaccination data.\nCrypto Play: An online\nplatform where users can\ncreate there fantasy teams\nand win rewards. The game is\nbuilt on Tezos blockchain\ntechnology. (Discontinued)"}