{"pages": [{"page_number": 1, "text": "Ayush ThakurCurriculum Vitae8715808090\nayusht hakur14 12@gmail.com\nJammu\nSummar y\nExperienced F ull Stack De veloper wit h a str ong back ground in softwar e and w eb\ndevelopment, Sustainable De velopment Goals, collaborativ e resear ch, and adv anced\ntechnical skills. Pr oven track r ecord in enhancing user engagement, str eamlining\nprocesses, agile met hodology , and r educing load times. Committ ed to environmental\nadvocacy and leadership, utilizing t echnology f or sustainable solutions t hat mak e a\nlasting impact.\nExperience\nNov 2022\ntoJun 2023Social Media Head - IUCEE Student Chapt er, MIET Jammu\n•Led r esear ch on Sustainable De velopment Goal (SDG 15) - Lif e on Land\n•Authored a r esear ch paper on SDG 15 - Lif e on Land.\n•Collaborat ed wit h interdisciplinar y teams t o develop strat egies f or pr omoting\nbiodiv ersity and ecosyst em conser vation.\n•Engaged wit h local communities and stak eholders t o promot e sustainable land use\npractices.\n•Receiv ed recognition fr om t he IUCEE f or out standing contributions t o environmental\nadvocacy and leadership.\nJun 2023\ntoJul 2023Full Stack De veloper - Nucleon, IIT Jammu , Intern\n•Developed and r eleased a scalable w eb application wit h a solid UI/UX design\nenhancing user engagement.\n•Utiliz ed modern fr ont-end framew orks and libraries t o create a responsiv e and\nintuitiv e user int erface, impr oving o verall usability and accessibility .\n•Implement ed featur es to reduce lat ency , ensuring f aster web response and a quick\nbooking syst em wit h str eamlined aut hentication pr ocesses.\n•Integrat ed an on-r oad ser vice f eatur e to addr ess an y issues users ma y encount er\nduring t heir r ental period.\nFeb 202 4\nOngoingFull Stack De veloper & AI/ML Engineer - Centr e for R esear ch Inno vation &\nEntr epreneurship , Intern\n•Engineer ed and deplo yed a scalable w eb application, enhancing user engagement\nthrough intuitiv e UI/UX design and r obust back end ar chitectur e.\n•Developed and int egrat ed machine learning models, achie ving a 95% accuracy rat e\nin predictiv e analytics.\n•Optimiz ed database queries and ser ver per formance, r educing load times b y 40%\nand impr oving o verall application efficiency .\n•Conduct ed code r eviews and pr ovided ment orship, ele vating t eam pr oficiency in\nmodern framew orks and best practices.\n•Implement ed robust security measur es, including encr yption, access contr ols, and\nregular vulnerability t esting, ensuring compliance wit h industr y standar ds."}, {"page_number": 2, "text": "Project s\nJun 2023\ntoJul 2023Rent Rally - Online Car R ental Syst em\n•Spearheaded t he de velopment of R ent Rally , a compr ehensiv e online car r ental\nsystem, enhancing cust omer accessibility and con venience.\n•Engineer ed a user -friendly int erface, r esulting in a 40% incr ease in cust omer\nengagement.\n•Optimiz ed back end operations, decr easing syst em do wntime b y 30% and\nimproving o verall efficiency .\nNov 2023\ntoFeb 202 4Campus W eather Insight\n•Developed and implement ed Campus W eather Insight pr oject, enhancing\nweather data accessibility f or over 1000 student s of Model Institut e of\nEngineering and T echnology , Jammu.\n•Engineer ed a r eal-time w eather monit oring syst em using R eact, Ja vaScript and\nPython, boosting data accuracy b y 25%.\n•Conduct ed user e xperience t esting, achie ving a 90% satisf action rat e among\ncampus users\nFeb 202 4People.ai\n•Engineer ed and deplo yed a compr ehensiv e syst em for evaluating and rating\npotential f aculty members, incorporating adv anced qualitativ e analysis\ntechniques.\n•Improved recruitment efficiency b y 30% wit h aut omat ed fitment assessment s,\naligning candidat es wit h institutional standar ds and cultur e.\n•Utiliz ed data-driv en met hodologies t o str eamline candidat e selection,\nsignificant ly impr oving t he quality of hir es and r educing t he time-t o-hir e by\n50%.\nEducation\n2021\nOngoingBachelor Graduat eFull-time\nModel Institut e of Engineering and T echnology (MIET), Jammu\nEngineering (8.5 CGP A)\n2020\nto2021Scholar| Second Y ear High School Student\nIndir a Public Higher Secondar y School, Jammu\nScience (80 %)\nSkills\n•JavaScript\n•Node package manager\n•React\n•MySQL"}, {"page_number": 3, "text": "•MongoDB\n•Linux\n•GIT\n•API T ool - P ostman\n•TypeScript\n•Authentication syst ems\n•Node.js\nCertifications\n•Responsiv e Web Design:\nhttps://www .freecodecamp.or g/cer tification/a yusht hakur /responsiv e-web-design\n•Legacy Ja vaScript Algorit hms and Data Structur es Cer tification:\nhttps://www .freecodecamp.or g/cer tification/a yusht hakur /javascript -algorit hms-and-data-structur es\n•Machine Learning wit h Pyt hon:\nhttps://coursera.or g/shar e/fc20c58e8f7 a84925b35aee291a454a7\n•Getting Star ted wit h AI using IBM W atson:\nhttps://coursera.or g/shar e/1f0da89caa27 d35ea84d40d817 9f1659\n•Introduction t o Relational Database and SQL:\nhttps://coursera.or g/shar e/271c0f e8e6cff e51a6952b9c3856f a2a"}], "extracted_info": {"name": "Ayush Thakur", "email": "12@gmail.com", "phone_number": "", "date_of_birth": "", "permanent_address": "", "highest_qualification": "MPA", "presented_count": 0, "research_publications_count": 0, "workshop_attended_count": 0, "work_experience_count": 0, "education_details": "2021\nOngoingBachelor Graduat eFull-time\nModel Institut e of Engineering and T echnology (MIET), Jammu\nEngineering (8.5 CGP A)\n2020\nto2021Scholar| Second Y ear High School Student\nIndir a Public Higher Secondar y School, Jammu\nScience (80 %)"}}